from PyTib.common import tib_sort

dunno = '''རེ་	རེ་	བྲེ་	བྲེ་
མ་	མ་	མེ་	མེ་
དག་	དག་	གང་	གང་
མགྲོན་པོ་	མགྲོན་པོ་	འགྲོན་པ་	འགྲོན་པ་
ནི་	ནི་	འདི་	འདི་
ནི་	ནི་	འདི་	འདི་
མི་	མི་	མ་	མ་
ལ་	ལ་	དེ་	དེ་
པ་ག་ལ་ཡོད	པ་ག་ལ་ཡོད	པ ར་ག་ལ་འགྱུར	པ ར་ག་ལ་འགྱུར
འདི་	འདི་	ནི་	ནི་
ཡོང་	ཡོང་	ཡོངས་	ཡོངས་
རུང་	རུང་	དུང་	དུང་
དོ	དོ	དོ	དེ
འདི་	འདི་	ནི་	ནི་
ན་	ན་	ནི་	ནི་
འདི་	འདི་	དེ་	དེ་
དང་	དང་	ནས་	ནས་
དང་	དང་	དག	དག
གལ་	གལ་	འོན་	འོན་
ནི	ནི	ཡང་	ཡང་
གམ་	གམ་	དང་	དང་
ཀརྣ་	ཀརྣ་	ཀརྞ་	ཀརྞ་
ནི་	ནི་	ཏེ་	ཏེ་
པ ས	པ ས	ཤིང་	ཤིང་
འདི་	འདི་	ནི་	ནི་
བ འང་	བ འང་	གང་	གང་
ནི	ནི	ན	ན
པ་ན འང་	པ་ན འང་	པ ས་ན	པ ས་ན
ནི་	ནི་	འདི་	འདི་
ན	ན	ནས	ནས
ལ་བདེ་བ འང་	ལ་བདེ་བ འང་	ལ འང་བདེ་བ་	ལ འང་བདེ་བ་
བདེ་	བདེ་	བ་	བ་
ནི	ནི	འདི	འདི
དེ་	དེ་	ཇི་	ཇི་
བྱ	བྱ	ན	ན
བཟད་	བཟད་	བཟད་	བཟོད་
རྔུ་	རྔུ་	རྔུ ས་	རྔུ ས་
ནི་	ནི་	གིས་	གིས་
ནི	ནི	ཡང་	ཡང་
འདྲ་བྱུང་བ ར་གྱུར	འདྲ་བྱུང་བ ར་གྱུར	འདྲ ར་བྱུང་གྱུར་ན	འདྲ ར་བྱུང་གྱུར་ན
དེ་ཡི་	དེ་ཡི་	དེ འི་ཡང་	དེ འི་ཡང་
ནི་	ནི་	ཉིད་	ཉིད་
ཡང་འཇུག་པ ར་བྱ	ཡང་འཇུག་པ ར་བྱ	ནི་འཇུག་པ ར་བྱེད	ནི་འཇུག་པ ར་བྱེད
ནི་	ནི་	གིས་	གིས་
པ ས་	པ ས་	ནས་	པ ས་
ཉིད་	ཉིད་	གིས་	གིས་
གྱིས་ནི་	གྱིས་ནི་	ཞིག་གི་	ཞིག་གི་
དང་	དང་	ལ་	ལ་
ལས་	ལས་	ལ་	ལ་
འདི་	འདི་	དེ་	དེ་
ནི་	ནི་	གྱིས་	གྱིས་
གང་	གང་	འགའ་	འགའ་
ལས་	ལས་	ལ་	ལ་
ཉིད་	ཉིད་	གི་	གི་
ཡིས	ཡིས	ཡིན	ཡི
དེ ས་གཞན་	དེ ས་གཞན་	ཡིས་གཞན་	ཡིས་གཞད་
ཐིགས་	ཐིགས་	ཐིག་	ཐིག་
གི་	གི་	ཉིད་	ཉིད་
གི་	གི་	ནི་	ནི་
ལས་	ལས་	བ ས་	བ ས་
འདས་	འདས་	འདའ་	འདའ་
སུམ་	སུམ་	ཚོགས་	ཚོགས་
གི	གི	ནི	ནི
ཅན་	ཅན་	བཅས་	བཅས་
ནི་	ནི་	གི་	གི་
དག་	དག་	རྣམས་	རྣམས་
ནི	ནི	ལ	ལ
ཞེ་	ཞེ་	ཞེས་	ཞེས་
ཉིད	ཉིད	ཞིང་	ཞིང་
པ འི་	པ འི་	དང་	དང་
པ་	པ་	ཅན་	ཅན་
ལ་	ལ་	ལས་	ལས་
ནི་	ནི་	ཉིད་	ཉིད་
ཅེ་	ཅེ་	ཅེས་	ཅེས་
དང་	དག	དག	དག
ནི་	ནི་	འདི་	འདི་
ཏེ	ཏེ	ན	ན
པ	པ	དེ	དེ
ཉིད་	ཉིད་	ནི་	ནི་
དག་	དག་	དང་	དང་
པ་སྐྱེ་བ ར་	པ་སྐྱེ་བ ར་	པ ར་སྐྱེ་བ་	པ ར་སྐྱེ་བ་
ཀྱིས་བཞག་	ཀྱིས་བཞག་	ཀྱི འང་གཞག་	ཀྱི འང་གཞག་
ཅིང་	ཅིང་	ཅིག	ཅིག
ཡོད	ཡོད	ཡིན	ཡིན
དེ་	དེ་	དང་	དང་
ནི་	ནི་	འདི་	འདི་
ཡི	ཡི	ཞིང་	ཞིང་
ནི	ནི	འདི	འདི
དང་	དག	དག	དག
དག་	དག་	ཡང་	ཡང་
པདྨ་	པདྨ་	པདྨོ་	པདྨོ་
ལྡན་	ལྡན་	པ་	པ་
མ་	མ་	མི་	མི་
ལས་ཞུས་	ལས་ཞུས་	ལ་གཏུགས་	ལ་གཏུགས་
'''
truc = dunno.split('\n')
#for line in tib_sort(truc):
#    print(line)
group1= '''འདི་	འདི་	དེ་	དེ་
འདི་	འདི་	དེ་	དེ་
འདི་	འདི་	ནི་	ནི་
འདི་	འདི་	ནི་	ནི་
འདི་	འདི་	ནི་	ནི་
ན	ན	ནས	ནས
ན་	ན་	ནི་	ནི་
ནི	ནི	འདི	འདི
ནི	ནི	འདི	འདི
ནི	ནི	ན	ན
ནི	ནི	ཡང་	ཡང་
ནི	ནི	ཡང་	ཡང་
ནི	ནི	ལ	ལ
ནི་	ནི་	གི་	གི་
ནི་	ནི་	གིས་	གིས་
ནི་	ནི་	གིས་	གིས་
ནི་	ནི་	གྱིས་	གྱིས་
ནི་	ནི་	ཉིད་	ཉིད་
ནི་	ནི་	ཉིད་	ཉིད་
ནི་	ནི་	ཏེ་	ཏེ་
ནི་	ནི་	འདི་	འདི་
ནི་	ནི་	འདི་	འདི་
ནི་	ནི་	འདི་	འདི་
ནི་	ནི་	འདི་	འདི་
ནི་	ནི་	འདི་	འདི་
'''
group2 = '''གམ་	གམ་	དང་	དང་
དག་	དག་	གང་	གང་
དག་	དག་	དང་	དང་
དག་	དག་	རྣམས་	རྣམས་
དག་	དག་	ཡང་	ཡང་
དང་	དག	དག	དག
དང་	དག	དག	དག
དང་	དང་	དག	དག
དང་	དང་	ནས་	ནས་
དང་	དང་	ལ་	ལ་
གང་	གང་	འགའ་	འགའ་
བ འང་	བ འང་	གང་	གང་
'''
group3 = '''གི	གི	ནི	ནི
གི་	གི་	ཉིད་	ཉིད་
གི་	གི་	ནི་	ནི་
ཉིད	ཉིད	ཞིང་	ཞིང་
ཉིད་	ཉིད་	གི་	གི་
ཉིད་	ཉིད་	གིས་	གིས་
ཉིད་	ཉིད་	ནི་	ནི་
ཡི	ཡི	ཞིང་	ཞིང་
ཡིས	ཡིས	ཡིན	ཡི
'''
group4 = '''པ	པ	དེ	དེ
པ འི་	པ འི་	དང་	དང་
པ ས	པ ས	ཤིང་	ཤིང་
པ ས་	པ ས་	ནས་	པ ས་
པ་	པ་	ཅན་	ཅན་
'''
group5 = '''ལས་	ལས་	བ ས་	བ ས་
ལས་	ལས་	ལ་	ལ་
ལས་	ལས་	ལ་	ལ་
ལ་	ལ་	ལས་	ལས་
'''
group6 = '''ཏེ	ཏེ	ན	ན
དེ་	དེ་	ཇི་	ཇི་
དེ་	དེ་	དང་	དང་
ལ་	ལ་	དེ་	དེ་
'''
group7 = '''ཅིང་	ཅིང་	ཅིག	ཅིག
ཅེ་	ཅེ་	ཅེས་	ཅེས་
'''
group8 = '''ཞེ་	ཞེ་	ཞེས་	ཞེས་
'''
groups = [group1, group2, group3, group4, group5, group6, group7, group8]
final = []
for group in groups:
    for g in group.split('\n'):
        alterns = list({a for a in g.split('\t') if a != ''})
        if alterns and alterns not in final:
            final.append(alterns)
for f in final:
    print(f)